app/Controllers/DashboardController.php

    public function index()
    {
        // Periksa apakah pengguna sudah login sebelum mengakses dashboard.
        if (!$this->isLoggedIn()) {
            return redirect()->to('/login')->with('error', 'Silakan login terlebih dahulu.');
        }

        // Ambil informasi pengguna dari sesi.
        $data['username'] = session('username');

        $bookModel = new BookModel();
        $data['books'] = $bookModel->findAll();
---
SELECT *
FROM `books`

    public function form()
    {
        $bookModel = new BookModel();
        $data['books'] = $bookModel->findAll();
---
SELECT *
FROM `books`