app/Models/BookModel.php

    public function getBooksWithCategory($category_id = null)
    {
        if ($category_id) {
            // Filter books by the selected category ID
            return $this->select('books.*, categories.name as category_name')
                ->join('categories', 'categories.id = books.category_id')
                ->where('categories.id', $category_id)
                ->get()
                ->getResultArray();
        } else {
            // If no category ID is provided, fetch all books with their categories
            return $this->select('books.*, categories.name')
                ->join('categories', 'categories.id = books.category_id')
                ->get()
                ->getResultArray();
---
SELECT `books`.*, `categories`.`name`
FROM `books`
JOIN `categories` ON `categories`.`id` = `books`.`category_id`
WHERE `categories`.`id` = '1'
SELECT `books`.*, `categories`.`name`
FROM `books`
JOIN `categories` ON `categories`.`id` = `books`.`category_id`