app/Models/CategoryModel.php

SELECT *
FROM `categories`
---
    public function getCategories()
    {
        return $this->findAll();

SELECT *
FROM `categories`
WHERE `categories`.`id` = '1'
---
    public function getCategory($id)
    {
        return $this->find($id);