app/Models/UserRoleModel.php

SELECT *
FROM `user_roles`
WHERE `user_id` = '4'
 LIMIT 1
---
    public function getRoleByUserId($user_id)
    {
        return $this->where('user_id', $user_id)->first();